testing/asciiart-load-test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:4567
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
    apdex:
      threshold: 100
    metrics-by-endpoint: {}
scenarios:
  - name: "Browse General Discussion"
    flow:
      - get:
          url: "/category/2/general-discussion"
      - think: 2
      - get:
          url: "/topic/3/republic"
      - think: 2
      - get:
          url: "/topic/4/indonesian"
      - think: 2